src/mp_toir/Documents/мп_ЗаданиеНаРемонт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>мп_ЗаданиеНаРемонт</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказНаРемонт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗаказНаРемонт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_СтатусыОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.мп_ИсточникиДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеРабот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнениеОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиНаработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПоказателяИзмерения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПроверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мп_ВидыПроверокОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатПроверки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмеренияПроверкиВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФотоотчетОбязателен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКИС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Продолжительность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Трудоемкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбщиеВидыРемонтов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЧеловек</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТехРешение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРемонта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРемонтов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияДанныхЕРП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МатериалыКСписанию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значок</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АвтоматическиДобавленнаяСтрока</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменаНоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменаХарактеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменаСерия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>МатериалыКОприходованию</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураВозврат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаВозврат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияВозврат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Фотографии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фото</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФотоПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасширениеФайла</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСтроку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УстановленныеТМЦ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыОбъектовЭксплуатации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатураВозврат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/mp_toir/Documents/мп_ЗаданиеНаРемонт/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция УстановленныеТМЦ(
	ОбъектЭксплуатации, ВыбранныйУзел, МатериалыКОприходованию, МатериалыКСписанию, ЗаменяемыеВидыНоменклатуры) Экспорт

	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("ОбъектЭксплуатации", ОбъектЭксплуатации);
	Запрос.УстановитьПараметр("МатериалыКСписанию", МатериалыКСписанию);
	Запрос.УстановитьПараметр("МатериалыКОприходованию", МатериалыКОприходованию);
	Запрос.УстановитьПараметр("ВыбранныйУзел", Справочники.УзлыОбъектовЭксплуатации.ПустаяСсылка());
	Запрос.УстановитьПараметр("ЗаменяемыеВидыНоменклатуры", ЗаменяемыеВидыНоменклатуры);
	Запрос.УстановитьПараметр("УчитыватьЗаменяемыеВидыНоменклатуры"
		, ?(ЗаменяемыеВидыНоменклатуры.Количество()> 0, Истина, Ложь));

	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Мечел_ТМЦВЭксплуатацииСписанныеНаРасходыСрезПоследних.Объект КАК ОбъектЭксплуатации,
	|	Мечел_ТМЦВЭксплуатацииСписанныеНаРасходыСрезПоследних.Узел КАК Узел,
	|	Мечел_ТМЦВЭксплуатацииСписанныеНаРасходыСрезПоследних.Номенклатура КАК Номенклатура,
	|	Мечел_ТМЦВЭксплуатацииСписанныеНаРасходыСрезПоследних.Характеристика КАК Характеристика,
	|	Мечел_ТМЦВЭксплуатацииСписанныеНаРасходыСрезПоследних.Серия КАК Серия,
	|	Мечел_ТМЦВЭксплуатацииСписанныеНаРасходыСрезПоследних.Количество КАК Количество
	|ПОМЕСТИТЬ вт_Остатки
	|ИЗ
	|	РегистрСведений.Мечел_ТМЦВЭксплуатацииСписанныеНаРасходы.СрезПоследних(
	|			,
	|			Объект = &ОбъектЭксплуатации
	|				И ВЫБОР
	|					КОГДА &ВыбранныйУзел = ЗНАЧЕНИЕ(Справочник.УзлыОбъектовЭксплуатации.ПустаяСсылка)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ &ВыбранныйУзел = Узел
	|				КОНЕЦ) КАК Мечел_ТМЦВЭксплуатацииСписанныеНаРасходыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(МатериалыКСписанию.ЗаменаНоменклатура КАК Справочник.Номенклатура) КАК ЗаменаНоменклатура,
	|	ВЫРАЗИТЬ(МатериалыКСписанию.ЗаменаХарактеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК ЗаменаХарактеристика,
	|	ВЫРАЗИТЬ(МатериалыКСписанию.ЗаменаСерия КАК Справочник.СерииНоменклатуры) КАК ЗаменаСерия,
	|	ВЫРАЗИТЬ(МатериалыКСписанию.Факт КАК ЧИСЛО(15, 2)) КАК Факт
	|ПОМЕСТИТЬ вт_МатериалыКСписанию
	|ИЗ
	|	&МатериалыКСписанию КАК МатериалыКСписанию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_МатериалыКСписанию.ЗаменаНоменклатура КАК ЗаменаНоменклатура,
	|	вт_МатериалыКСписанию.ЗаменаХарактеристика КАК ЗаменаХарактеристика,
	|	вт_МатериалыКСписанию.ЗаменаСерия КАК ЗаменаСерия,
	|	СУММА(вт_МатериалыКСписанию.Факт) КАК Факт
	|ПОМЕСТИТЬ вт_МатериалыКСписаниюСводная
	|ИЗ
	|	вт_МатериалыКСписанию КАК вт_МатериалыКСписанию
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_МатериалыКСписанию.ЗаменаНоменклатура,
	|	вт_МатериалыКСписанию.ЗаменаХарактеристика,
	|	вт_МатериалыКСписанию.ЗаменаСерия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(МатериалыКОприходованию.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	ВЫРАЗИТЬ(МатериалыКОприходованию.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	|	ВЫРАЗИТЬ(МатериалыКОприходованию.Серия КАК Справочник.СерииНоменклатуры) КАК Серия,
	|	ВЫРАЗИТЬ(МатериалыКОприходованию.Количество КАК ЧИСЛО(15, 3)) КАК Количество
	|ПОМЕСТИТЬ вт_МатериалыКОприходованию
	|ИЗ
	|	&МатериалыКОприходованию КАК МатериалыКОприходованию
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_МатериалыКОприходованию.Номенклатура КАК Номенклатура,
	|	вт_МатериалыКОприходованию.Характеристика КАК Характеристика,
	|	вт_МатериалыКОприходованию.Серия КАК Серия,
	|	СУММА(вт_МатериалыКОприходованию.Количество) КАК Количество
	|ПОМЕСТИТЬ вт_МатериалыКОприходованиюСводная
	|ИЗ
	|	вт_МатериалыКОприходованию КАК вт_МатериалыКОприходованию
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_МатериалыКОприходованию.Номенклатура,
	|	вт_МатериалыКОприходованию.Характеристика,
	|	вт_МатериалыКОприходованию.Серия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_Остатки.ОбъектЭксплуатации КАК ОбъектЭксплуатации,
	|	вт_Остатки.Узел КАК Узел,
	|	СпрНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	|	вт_Остатки.Номенклатура КАК Номенклатура,
	|	СпрНоменклатура.Код КАК Код,
	|	вт_Остатки.Характеристика КАК Характеристика,
	|	вт_Остатки.Серия КАК Серия,
	|	СУММА(вт_Остатки.Количество - ЕСТЬNULL(вт_МатериалыКСписаниюСводная.Факт, 0) - ЕСТЬNULL(вт_МатериалыКОприходованиюСводная.Количество, 0)) КАК Количество
	|ИЗ
	|	вт_Остатки КАК вт_Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_МатериалыКСписаниюСводная КАК вт_МатериалыКСписаниюСводная
	|		ПО вт_Остатки.Номенклатура = вт_МатериалыКСписаниюСводная.ЗаменаНоменклатура
	|			И вт_Остатки.Характеристика = вт_МатериалыКСписаниюСводная.ЗаменаХарактеристика
	|			И вт_Остатки.Серия = вт_МатериалыКСписаниюСводная.ЗаменаСерия
	|		ЛЕВОЕ СОЕДИНЕНИЕ вт_МатериалыКОприходованиюСводная КАК вт_МатериалыКОприходованиюСводная
	|		ПО вт_Остатки.Номенклатура = вт_МатериалыКОприходованиюСводная.Номенклатура
	|			И вт_Остатки.Характеристика = вт_МатериалыКОприходованиюСводная.Характеристика
	|			И вт_Остатки.Серия = вт_МатериалыКОприходованиюСводная.Серия
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
	|		ПО вт_Остатки.Номенклатура = СпрНоменклатура.Ссылка
	|ГДЕ
	|	ВЫБОР
	|			КОГДА &УчитыватьЗаменяемыеВидыНоменклатуры
	|				ТОГДА НЕ СпрНоменклатура.ВидНоменклатуры В ИЕРАРХИИ (&ЗаменяемыеВидыНоменклатуры)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	вт_Остатки.ОбъектЭксплуатации,
	|	вт_Остатки.Узел,
	|	вт_Остатки.Номенклатура,
	|	вт_Остатки.Характеристика,
	|	вт_Остатки.Серия,
	|	СпрНоменклатура.ВидНоменклатуры,
	|	СпрНоменклатура.Код
	|
	|ИМЕЮЩИЕ
	|	СУММА(вт_Остатки.Количество - ЕСТЬNULL(вт_МатериалыКСписаниюСводная.Факт, 0) - ЕСТЬNULL(вт_МатериалыКОприходованиюСводная.Количество, 0)) > 0";

	Результат = Запрос.Выполнить();

	Возврат Результат.Выгрузить();

КонецФункции

Функция СостояниеВыполнениеОперации(ВыполнениеОперации) Экспорт

	ФлагиВыполнения = Новый Массив;
	ФлагиВыполнения.Добавить("""Да""");
	ФлагиВыполнения.Добавить("""Нет""");
	Возврат ?(ФлагиВыполнения.Найти(ВыполнениеОперации) = Неопределено, Ложь, Истина);

КонецФункции

// Выбрать изменения (регистрация) документа 
//
// Возвращаемое значение:
//  РезультатЗапроса, Неопределено - Результат запроса.
//
Функция ВыбратьИзменения() Экспорт

	Запрос = Новый Запрос;

	Запрос.Текст =
	"ВЫБРАТЬ
	|	мп_ЗаданиеНаРемонтИзменения.Ссылка КАК Ссылка,
	|	мп_ЗаданиеНаРемонт.ЗаказНаРемонт.УИД КАК ЗаказНаРемонтУИД
	|ИЗ
	|	Документ.мп_ЗаданиеНаРемонт.Изменения КАК мп_ЗаданиеНаРемонтИзменения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.мп_ЗаданиеНаРемонт КАК мп_ЗаданиеНаРемонт
	|		ПО мп_ЗаданиеНаРемонтИзменения.Ссылка = мп_ЗаданиеНаРемонт.Ссылка";
	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса;

КонецФункции

#КонецОбласти

#КонецЕсли
